grevaillot/svd_tools/headers/STM32L4R9/gpioa.h
#pragma once 

/* --- GPIOA: General-purpose I/Os ---------------------------------- */

/** @defgroup gpioa_registers General-purpose I/Os Register
@{*/

/** GPIOA_MODER GPIO port mode register **/
#define GPIOA_MODER			MMIO32(GPIOA_BASE + 0x00)
/** GPIOA_OTYPER GPIO port output type register **/
#define GPIOA_OTYPER			MMIO32(GPIOA_BASE + 0x04)
/** GPIOA_OSPEEDR GPIO port output speed register **/
#define GPIOA_OSPEEDR			MMIO32(GPIOA_BASE + 0x08)
/** GPIOA_PUPDR GPIO port pull-up/pull-down register **/
#define GPIOA_PUPDR			MMIO32(GPIOA_BASE + 0x0c)
/** GPIOA_IDR GPIO port input data register **/
#define GPIOA_IDR			MMIO32(GPIOA_BASE + 0x10)
/** GPIOA_ODR GPIO port output data register **/
#define GPIOA_ODR			MMIO32(GPIOA_BASE + 0x14)
/** GPIOA_BSRR GPIO port bit set/reset register **/
#define GPIOA_BSRR			MMIO32(GPIOA_BASE + 0x18)
/** GPIOA_LCKR GPIO port configuration lock register **/
#define GPIOA_LCKR			MMIO32(GPIOA_BASE + 0x1c)
/** GPIOA_AFRL GPIO alternate function low register **/
#define GPIOA_AFRL			MMIO32(GPIOA_BASE + 0x20)
/** GPIOA_AFRH GPIO alternate function high register **/
#define GPIOA_AFRH			MMIO32(GPIOA_BASE + 0x24)
/** GPIOA_BRR GPIO port bit reset register **/
#define GPIOA_BRR			MMIO32(GPIOA_BASE + 0x28)
/** GPIOA_ASCR GPIO port analog switch control register **/
#define GPIOA_ASCR			MMIO32(GPIOA_BASE + 0x2c)

/**@}*/


/** @defgroup gpioa_moder MODER GPIO port mode register
@{*/


#define GPIOA_MODER_MODER15_SHIFT		30
#define GPIOA_MODER_MODER15_MASK		0x03
/** @defgroup gpioa_moder_moder15 MODER15 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOA_MODER_MODER14_SHIFT		28
#define GPIOA_MODER_MODER14_MASK		0x03
/** @defgroup gpioa_moder_moder14 MODER14 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOA_MODER_MODER13_SHIFT		26
#define GPIOA_MODER_MODER13_MASK		0x03
/** @defgroup gpioa_moder_moder13 MODER13 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOA_MODER_MODER12_SHIFT		24
#define GPIOA_MODER_MODER12_MASK		0x03
/** @defgroup gpioa_moder_moder12 MODER12 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOA_MODER_MODER11_SHIFT		22
#define GPIOA_MODER_MODER11_MASK		0x03
/** @defgroup gpioa_moder_moder11 MODER11 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOA_MODER_MODER10_SHIFT		20
#define GPIOA_MODER_MODER10_MASK		0x03
/** @defgroup gpioa_moder_moder10 MODER10 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOA_MODER_MODER9_SHIFT		18
#define GPIOA_MODER_MODER9_MASK		0x03
/** @defgroup gpioa_moder_moder9 MODER9 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOA_MODER_MODER8_SHIFT		16
#define GPIOA_MODER_MODER8_MASK		0x03
/** @defgroup gpioa_moder_moder8 MODER8 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOA_MODER_MODER7_SHIFT		14
#define GPIOA_MODER_MODER7_MASK		0x03
/** @defgroup gpioa_moder_moder7 MODER7 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOA_MODER_MODER6_SHIFT		12
#define GPIOA_MODER_MODER6_MASK		0x03
/** @defgroup gpioa_moder_moder6 MODER6 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOA_MODER_MODER5_SHIFT		10
#define GPIOA_MODER_MODER5_MASK		0x03
/** @defgroup gpioa_moder_moder5 MODER5 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOA_MODER_MODER4_SHIFT		8
#define GPIOA_MODER_MODER4_MASK		0x03
/** @defgroup gpioa_moder_moder4 MODER4 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOA_MODER_MODER3_SHIFT		6
#define GPIOA_MODER_MODER3_MASK		0x03
/** @defgroup gpioa_moder_moder3 MODER3 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOA_MODER_MODER2_SHIFT		4
#define GPIOA_MODER_MODER2_MASK		0x03
/** @defgroup gpioa_moder_moder2 MODER2 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOA_MODER_MODER1_SHIFT		2
#define GPIOA_MODER_MODER1_MASK		0x03
/** @defgroup gpioa_moder_moder1 MODER1 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOA_MODER_MODER0_SHIFT		0
#define GPIOA_MODER_MODER0_MASK		0x03
/** @defgroup gpioa_moder_moder0 MODER0 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


/**@}*/

/** @defgroup gpioa_otyper OTYPER GPIO port output type register
@{*/

/** GPIOA_OTYPER_OT15 Port x configuration bits (y = 0..15) **/
#define GPIOA_OTYPER_OT15		(1 << 15)
/** GPIOA_OTYPER_OT14 Port x configuration bits (y = 0..15) **/
#define GPIOA_OTYPER_OT14		(1 << 14)
/** GPIOA_OTYPER_OT13 Port x configuration bits (y = 0..15) **/
#define GPIOA_OTYPER_OT13		(1 << 13)
/** GPIOA_OTYPER_OT12 Port x configuration bits (y = 0..15) **/
#define GPIOA_OTYPER_OT12		(1 << 12)
/** GPIOA_OTYPER_OT11 Port x configuration bits (y = 0..15) **/
#define GPIOA_OTYPER_OT11		(1 << 11)
/** GPIOA_OTYPER_OT10 Port x configuration bits (y = 0..15) **/
#define GPIOA_OTYPER_OT10		(1 << 10)
/** GPIOA_OTYPER_OT9 Port x configuration bits (y = 0..15) **/
#define GPIOA_OTYPER_OT9		(1 << 9)
/** GPIOA_OTYPER_OT8 Port x configuration bits (y = 0..15) **/
#define GPIOA_OTYPER_OT8		(1 << 8)
/** GPIOA_OTYPER_OT7 Port x configuration bits (y = 0..15) **/
#define GPIOA_OTYPER_OT7		(1 << 7)
/** GPIOA_OTYPER_OT6 Port x configuration bits (y = 0..15) **/
#define GPIOA_OTYPER_OT6		(1 << 6)
/** GPIOA_OTYPER_OT5 Port x configuration bits (y = 0..15) **/
#define GPIOA_OTYPER_OT5		(1 << 5)
/** GPIOA_OTYPER_OT4 Port x configuration bits (y = 0..15) **/
#define GPIOA_OTYPER_OT4		(1 << 4)
/** GPIOA_OTYPER_OT3 Port x configuration bits (y = 0..15) **/
#define GPIOA_OTYPER_OT3		(1 << 3)
/** GPIOA_OTYPER_OT2 Port x configuration bits (y = 0..15) **/
#define GPIOA_OTYPER_OT2		(1 << 2)
/** GPIOA_OTYPER_OT1 Port x configuration bits (y = 0..15) **/
#define GPIOA_OTYPER_OT1		(1 << 1)
/** GPIOA_OTYPER_OT0 Port x configuration bits (y = 0..15) **/
#define GPIOA_OTYPER_OT0		(1 << 0)

/**@}*/

/** @defgroup gpioa_ospeedr OSPEEDR GPIO port output speed register
@{*/


#define GPIOA_OSPEEDR_OSPEEDR15_SHIFT		30
#define GPIOA_OSPEEDR_OSPEEDR15_MASK		0x03
/** @defgroup gpioa_ospeedr_ospeedr15 OSPEEDR15 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOA_OSPEEDR_OSPEEDR14_SHIFT		28
#define GPIOA_OSPEEDR_OSPEEDR14_MASK		0x03
/** @defgroup gpioa_ospeedr_ospeedr14 OSPEEDR14 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOA_OSPEEDR_OSPEEDR13_SHIFT		26
#define GPIOA_OSPEEDR_OSPEEDR13_MASK		0x03
/** @defgroup gpioa_ospeedr_ospeedr13 OSPEEDR13 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOA_OSPEEDR_OSPEEDR12_SHIFT		24
#define GPIOA_OSPEEDR_OSPEEDR12_MASK		0x03
/** @defgroup gpioa_ospeedr_ospeedr12 OSPEEDR12 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOA_OSPEEDR_OSPEEDR11_SHIFT		22
#define GPIOA_OSPEEDR_OSPEEDR11_MASK		0x03
/** @defgroup gpioa_ospeedr_ospeedr11 OSPEEDR11 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOA_OSPEEDR_OSPEEDR10_SHIFT		20
#define GPIOA_OSPEEDR_OSPEEDR10_MASK		0x03
/** @defgroup gpioa_ospeedr_ospeedr10 OSPEEDR10 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOA_OSPEEDR_OSPEEDR9_SHIFT		18
#define GPIOA_OSPEEDR_OSPEEDR9_MASK		0x03
/** @defgroup gpioa_ospeedr_ospeedr9 OSPEEDR9 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOA_OSPEEDR_OSPEEDR8_SHIFT		16
#define GPIOA_OSPEEDR_OSPEEDR8_MASK		0x03
/** @defgroup gpioa_ospeedr_ospeedr8 OSPEEDR8 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOA_OSPEEDR_OSPEEDR7_SHIFT		14
#define GPIOA_OSPEEDR_OSPEEDR7_MASK		0x03
/** @defgroup gpioa_ospeedr_ospeedr7 OSPEEDR7 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOA_OSPEEDR_OSPEEDR6_SHIFT		12
#define GPIOA_OSPEEDR_OSPEEDR6_MASK		0x03
/** @defgroup gpioa_ospeedr_ospeedr6 OSPEEDR6 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOA_OSPEEDR_OSPEEDR5_SHIFT		10
#define GPIOA_OSPEEDR_OSPEEDR5_MASK		0x03
/** @defgroup gpioa_ospeedr_ospeedr5 OSPEEDR5 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


#define GPIOA_OSPEEDR_OSPEEDR4_SHIFT		8
#define GPIOA_OSPEEDR_OSPEEDR4_MASK		0x03
/** @defgroup gpioa_ospeedr_ospeedr4 OSPEEDR4 Port x configuration bits (y = 0..15)
@{*/
/**@}*/


