grevaillot/svd_tools/headers/STM32L4R9/gpioa.h
/** GPIOA_BSRR_BR15 Port x reset bit y (y = 0..15) **/
#define GPIOA_BSRR_BR15		(1 << 31)
/** GPIOA_BSRR_BR14 Port x reset bit y (y = 0..15) **/
#define GPIOA_BSRR_BR14		(1 << 30)
/** GPIOA_BSRR_BR13 Port x reset bit y (y = 0..15) **/
#define GPIOA_BSRR_BR13		(1 << 29)
/** GPIOA_BSRR_BR12 Port x reset bit y (y = 0..15) **/
#define GPIOA_BSRR_BR12		(1 << 28)
/** GPIOA_BSRR_BR11 Port x reset bit y (y = 0..15) **/
#define GPIOA_BSRR_BR11		(1 << 27)
/** GPIOA_BSRR_BR10 Port x reset bit y (y = 0..15) **/
#define GPIOA_BSRR_BR10		(1 << 26)
/** GPIOA_BSRR_BR9 Port x reset bit y (y = 0..15) **/
#define GPIOA_BSRR_BR9		(1 << 25)
/** GPIOA_BSRR_BR8 Port x reset bit y (y = 0..15) **/
#define GPIOA_BSRR_BR8		(1 << 24)
/** GPIOA_BSRR_BR7 Port x reset bit y (y = 0..15) **/
#define GPIOA_BSRR_BR7		(1 << 23)
/** GPIOA_BSRR_BR6 Port x reset bit y (y = 0..15) **/
#define GPIOA_BSRR_BR6		(1 << 22)
/** GPIOA_BSRR_BR5 Port x reset bit y (y = 0..15) **/
#define GPIOA_BSRR_BR5		(1 << 21)
/** GPIOA_BSRR_BR4 Port x reset bit y (y = 0..15) **/
#define GPIOA_BSRR_BR4		(1 << 20)
/** GPIOA_BSRR_BR3 Port x reset bit y (y = 0..15) **/
#define GPIOA_BSRR_BR3		(1 << 19)
/** GPIOA_BSRR_BR2 Port x reset bit y (y = 0..15) **/
#define GPIOA_BSRR_BR2		(1 << 18)
/** GPIOA_BSRR_BR1 Port x reset bit y (y = 0..15) **/
#define GPIOA_BSRR_BR1		(1 << 17)
/** GPIOA_BSRR_BR0 Port x set bit y (y= 0..15) **/
#define GPIOA_BSRR_BR0		(1 << 16)
/** GPIOA_BSRR_BS15 Port x set bit y (y= 0..15) **/
#define GPIOA_BSRR_BS15		(1 << 15)
/** GPIOA_BSRR_BS14 Port x set bit y (y= 0..15) **/
#define GPIOA_BSRR_BS14		(1 << 14)
/** GPIOA_BSRR_BS13 Port x set bit y (y= 0..15) **/
#define GPIOA_BSRR_BS13		(1 << 13)
/** GPIOA_BSRR_BS12 Port x set bit y (y= 0..15) **/
#define GPIOA_BSRR_BS12		(1 << 12)
/** GPIOA_BSRR_BS11 Port x set bit y (y= 0..15) **/
#define GPIOA_BSRR_BS11		(1 << 11)
/** GPIOA_BSRR_BS10 Port x set bit y (y= 0..15) **/
#define GPIOA_BSRR_BS10		(1 << 10)
/** GPIOA_BSRR_BS9 Port x set bit y (y= 0..15) **/
#define GPIOA_BSRR_BS9		(1 << 9)
/** GPIOA_BSRR_BS8 Port x set bit y (y= 0..15) **/
#define GPIOA_BSRR_BS8		(1 << 8)
/** GPIOA_BSRR_BS7 Port x set bit y (y= 0..15) **/
#define GPIOA_BSRR_BS7		(1 << 7)
/** GPIOA_BSRR_BS6 Port x set bit y (y= 0..15) **/
#define GPIOA_BSRR_BS6		(1 << 6)
/** GPIOA_BSRR_BS5 Port x set bit y (y= 0..15) **/
#define GPIOA_BSRR_BS5		(1 << 5)
/** GPIOA_BSRR_BS4 Port x set bit y (y= 0..15) **/
#define GPIOA_BSRR_BS4		(1 << 4)
/** GPIOA_BSRR_BS3 Port x set bit y (y= 0..15) **/
#define GPIOA_BSRR_BS3		(1 << 3)
/** GPIOA_BSRR_BS2 Port x set bit y (y= 0..15) **/
#define GPIOA_BSRR_BS2		(1 << 2)
/** GPIOA_BSRR_BS1 Port x set bit y (y= 0..15) **/
#define GPIOA_BSRR_BS1		(1 << 1)
/** GPIOA_BSRR_BS0 Port x set bit y (y= 0..15) **/
#define GPIOA_BSRR_BS0		(1 << 0)

/**@}*/

/** @defgroup gpioa_lckr LCKR GPIO port configuration lock register
@{*/

/** GPIOA_LCKR_LCKK Port x lock bit y (y= 0..15) **/
#define GPIOA_LCKR_LCKK		(1 << 16)
/** GPIOA_LCKR_LCK15 Port x lock bit y (y= 0..15) **/
#define GPIOA_LCKR_LCK15		(1 << 15)
/** GPIOA_LCKR_LCK14 Port x lock bit y (y= 0..15) **/
#define GPIOA_LCKR_LCK14		(1 << 14)
/** GPIOA_LCKR_LCK13 Port x lock bit y (y= 0..15) **/
#define GPIOA_LCKR_LCK13		(1 << 13)
/** GPIOA_LCKR_LCK12 Port x lock bit y (y= 0..15) **/
#define GPIOA_LCKR_LCK12		(1 << 12)
/** GPIOA_LCKR_LCK11 Port x lock bit y (y= 0..15) **/
#define GPIOA_LCKR_LCK11		(1 << 11)
/** GPIOA_LCKR_LCK10 Port x lock bit y (y= 0..15) **/
#define GPIOA_LCKR_LCK10		(1 << 10)
/** GPIOA_LCKR_LCK9 Port x lock bit y (y= 0..15) **/
#define GPIOA_LCKR_LCK9		(1 << 9)
/** GPIOA_LCKR_LCK8 Port x lock bit y (y= 0..15) **/
#define GPIOA_LCKR_LCK8		(1 << 8)
/** GPIOA_LCKR_LCK7 Port x lock bit y (y= 0..15) **/
#define GPIOA_LCKR_LCK7		(1 << 7)
/** GPIOA_LCKR_LCK6 Port x lock bit y (y= 0..15) **/
#define GPIOA_LCKR_LCK6		(1 << 6)
/** GPIOA_LCKR_LCK5 Port x lock bit y (y= 0..15) **/
#define GPIOA_LCKR_LCK5		(1 << 5)
/** GPIOA_LCKR_LCK4 Port x lock bit y (y= 0..15) **/
#define GPIOA_LCKR_LCK4		(1 << 4)
/** GPIOA_LCKR_LCK3 Port x lock bit y (y= 0..15) **/
#define GPIOA_LCKR_LCK3		(1 << 3)
/** GPIOA_LCKR_LCK2 Port x lock bit y (y= 0..15) **/
#define GPIOA_LCKR_LCK2		(1 << 2)
/** GPIOA_LCKR_LCK1 Port x lock bit y (y= 0..15) **/
#define GPIOA_LCKR_LCK1		(1 << 1)
/** GPIOA_LCKR_LCK0 Port x lock bit y (y= 0..15) **/
#define GPIOA_LCKR_LCK0		(1 << 0)

/**@}*/

/** @defgroup gpioa_afrl AFRL GPIO alternate function low register
@{*/


#define GPIOA_AFRL_AFRL7_SHIFT		28
#define GPIOA_AFRL_AFRL7_MASK		0x0f
/** @defgroup gpioa_afrl_afrl7 AFRL7 Alternate function selection for port x bit y (y = 0..7)
@{*/
/**@}*/


#define GPIOA_AFRL_AFRL6_SHIFT		24
#define GPIOA_AFRL_AFRL6_MASK		0x0f
/** @defgroup gpioa_afrl_afrl6 AFRL6 Alternate function selection for port x bit y (y = 0..7)
@{*/
/**@}*/


#define GPIOA_AFRL_AFRL5_SHIFT		20
#define GPIOA_AFRL_AFRL5_MASK		0x0f
/** @defgroup gpioa_afrl_afrl5 AFRL5 Alternate function selection for port x bit y (y = 0..7)
@{*/
/**@}*/


#define GPIOA_AFRL_AFRL4_SHIFT		16
#define GPIOA_AFRL_AFRL4_MASK		0x0f
/** @defgroup gpioa_afrl_afrl4 AFRL4 Alternate function selection for port x bit y (y = 0..7)
@{*/
/**@}*/


#define GPIOA_AFRL_AFRL3_SHIFT		12
#define GPIOA_AFRL_AFRL3_MASK		0x0f
/** @defgroup gpioa_afrl_afrl3 AFRL3 Alternate function selection for port x bit y (y = 0..7)
@{*/
/**@}*/


#define GPIOA_AFRL_AFRL2_SHIFT		8
#define GPIOA_AFRL_AFRL2_MASK		0x0f
/** @defgroup gpioa_afrl_afrl2 AFRL2 Alternate function selection for port x bit y (y = 0..7)
@{*/
/**@}*/


#define GPIOA_AFRL_AFRL1_SHIFT		4
#define GPIOA_AFRL_AFRL1_MASK		0x0f
/** @defgroup gpioa_afrl_afrl1 AFRL1 Alternate function selection for port x bit y (y = 0..7)
@{*/
/**@}*/


#define GPIOA_AFRL_AFRL0_SHIFT		0
#define GPIOA_AFRL_AFRL0_MASK		0x0f
/** @defgroup gpioa_afrl_afrl0 AFRL0 Alternate function selection for port x bit y (y = 0..7)
@{*/
/**@}*/


/**@}*/

/** @defgroup gpioa_afrh AFRH GPIO alternate function high register
@{*/


#define GPIOA_AFRH_AFRH15_SHIFT		28
#define GPIOA_AFRH_AFRH15_MASK		0x0f
/** @defgroup gpioa_afrh_afrh15 AFRH15 Alternate function selection for port x bit y (y = 8..15)
@{*/
/**@}*/


#define GPIOA_AFRH_AFRH14_SHIFT		24
#define GPIOA_AFRH_AFRH14_MASK		0x0f
/** @defgroup gpioa_afrh_afrh14 AFRH14 Alternate function selection for port x bit y (y = 8..15)
@{*/
/**@}*/


#define GPIOA_AFRH_AFRH13_SHIFT		20
#define GPIOA_AFRH_AFRH13_MASK		0x0f
/** @defgroup gpioa_afrh_afrh13 AFRH13 Alternate function selection for port x bit y (y = 8..15)
@{*/
/**@}*/


#define GPIOA_AFRH_AFRH12_SHIFT		16
#define GPIOA_AFRH_AFRH12_MASK		0x0f
/** @defgroup gpioa_afrh_afrh12 AFRH12 Alternate function selection for port x bit y (y = 8..15)
@{*/
/**@}*/


#define GPIOA_AFRH_AFRH11_SHIFT		12
#define GPIOA_AFRH_AFRH11_MASK		0x0f
/** @defgroup gpioa_afrh_afrh11 AFRH11 Alternate function selection for port x bit y (y = 8..15)
@{*/
/**@}*/


#define GPIOA_AFRH_AFRH10_SHIFT		8
#define GPIOA_AFRH_AFRH10_MASK		0x0f
/** @defgroup gpioa_afrh_afrh10 AFRH10 Alternate function selection for port x bit y (y = 8..15)
@{*/
/**@}*/


#define GPIOA_AFRH_AFRH9_SHIFT		4
#define GPIOA_AFRH_AFRH9_MASK		0x0f
/** @defgroup gpioa_afrh_afrh9 AFRH9 Alternate function selection for port x bit y (y = 8..15)
@{*/
/**@}*/


#define GPIOA_AFRH_AFRH8_SHIFT		0
#define GPIOA_AFRH_AFRH8_MASK		0x0f
/** @defgroup gpioa_afrh_afrh8 AFRH8 Alternate function selection for port x bit y (y = 8..15)
@{*/
/**@}*/


/**@}*/

/** @defgroup gpioa_brr BRR GPIO port bit reset register
@{*/

/** GPIOA_BRR_BR15 Port Reset bit **/
#define GPIOA_BRR_BR15		(1 << 15)
/** GPIOA_BRR_BR14 Port Reset bit **/
#define GPIOA_BRR_BR14		(1 << 14)
/** GPIOA_BRR_BR13 Port Reset bit **/
#define GPIOA_BRR_BR13		(1 << 13)
/** GPIOA_BRR_BR12 Port Reset bit **/
#define GPIOA_BRR_BR12		(1 << 12)
/** GPIOA_BRR_BR11 Port Reset bit **/
#define GPIOA_BRR_BR11		(1 << 11)
/** GPIOA_BRR_BR10 Port Reset bit **/
#define GPIOA_BRR_BR10		(1 << 10)
/** GPIOA_BRR_BR9 Port Reset bit **/
#define GPIOA_BRR_BR9		(1 << 9)
/** GPIOA_BRR_BR8 Port Reset bit **/
#define GPIOA_BRR_BR8		(1 << 8)
/** GPIOA_BRR_BR7 Port Reset bit **/
#define GPIOA_BRR_BR7		(1 << 7)
/** GPIOA_BRR_BR6 Port Reset bit **/
#define GPIOA_BRR_BR6		(1 << 6)
/** GPIOA_BRR_BR5 Port Reset bit **/
#define GPIOA_BRR_BR5		(1 << 5)
/** GPIOA_BRR_BR4 Port Reset bit **/
#define GPIOA_BRR_BR4		(1 << 4)
/** GPIOA_BRR_BR3 Port Reset bit **/
#define GPIOA_BRR_BR3		(1 << 3)
/** GPIOA_BRR_BR2 Port Reset bit **/
#define GPIOA_BRR_BR2		(1 << 2)
/** GPIOA_BRR_BR1 Port Reset bit **/
#define GPIOA_BRR_BR1		(1 << 1)
/** GPIOA_BRR_BR0 Port Reset bit **/
#define GPIOA_BRR_BR0		(1 << 0)

/**@}*/

/** @defgroup gpioa_ascr ASCR GPIO port analog switch control register
@{*/

/** GPIOA_ASCR_ASC15 Port analog switch control **/
#define GPIOA_ASCR_ASC15		(1 << 15)
/** GPIOA_ASCR_ASC14 Port analog switch control **/
#define GPIOA_ASCR_ASC14		(1 << 14)
/** GPIOA_ASCR_ASC13 Port analog switch control **/
#define GPIOA_ASCR_ASC13		(1 << 13)
/** GPIOA_ASCR_ASC12 Port analog switch control **/
#define GPIOA_ASCR_ASC12		(1 << 12)
/** GPIOA_ASCR_ASC11 Port analog switch control **/
#define GPIOA_ASCR_ASC11		(1 << 11)
/** GPIOA_ASCR_ASC10 Port analog switch control **/
#define GPIOA_ASCR_ASC10		(1 << 10)
/** GPIOA_ASCR_ASC9 Port analog switch control **/
#define GPIOA_ASCR_ASC9		(1 << 9)
/** GPIOA_ASCR_ASC8 Port analog switch control **/
#define GPIOA_ASCR_ASC8		(1 << 8)
/** GPIOA_ASCR_ASC7 Port analog switch control **/
#define GPIOA_ASCR_ASC7		(1 << 7)
/** GPIOA_ASCR_ASC6 Port analog switch control **/
#define GPIOA_ASCR_ASC6		(1 << 6)
/** GPIOA_ASCR_ASC5 Port analog switch control **/
#define GPIOA_ASCR_ASC5		(1 << 5)
/** GPIOA_ASCR_ASC4 Port analog switch control **/
#define GPIOA_ASCR_ASC4		(1 << 4)
/** GPIOA_ASCR_ASC3 Port analog switch control **/
#define GPIOA_ASCR_ASC3		(1 << 3)
/** GPIOA_ASCR_ASC2 Port analog switch control **/
#define GPIOA_ASCR_ASC2		(1 << 2)
/** GPIOA_ASCR_ASC1 Port analog switch control **/
#define GPIOA_ASCR_ASC1		(1 << 1)
/** GPIOA_ASCR_ASC0 Port analog switch control **/
#define GPIOA_ASCR_ASC0		(1 << 0)

/**@}*/
